/*Необхідно знайти найменшу кількість пересічень цеглинок в стіні  */

// Стіна
let wall = [
  [1, 2, 2, 1],
  [3, 1, 2],
  [1, 3, 2],
  [1, 3, 2],
  [2, 4],
  [3, 1, 2],
  [1, 3, 1, 1],
];

const leastBricks = function (wall) {
  // Об'єкт для зберігання позицій стиків між цеглинами
  let map = {};
  // Змінна для відстеження максимальної кількості стиків на одній позиції
  let max = 0;

  wall.forEach((row) => {
    // Кумулятивна сума ширин цеглин
    let sum = 0;
    // Проходимо до передостанньої цеглини
    for (let n = 0; n < row.length - 1; n++) {
      // Додаємо ширину поточної цеглини
      sum += row[n];
      // Оновлюємо кількість стиків на цій позиції
      map[sum] = map[sum] ? map[sum] + 1 : 1;
      // Оновлюємо максимум стиків
      max = Math.max(map[sum], max);
    }
  });
  return wall.length - max;
};

// Логи
console.log(leastBricks(wall));
